colocation/ref-results/pgbench-100_llama/pgbench-100.txt
pgbench (17.2 (Debian 17.2-1.pgdg120+1))
starting vacuum...end.
transaction type: <builtin: select only>
scaling factor: 1000
query mode: simple
number of clients: 100
number of threads: 6
maximum number of tries: 1
duration: 250 s
number of transactions actually processed: 89783204
number of failed transactions: 0 (0.000%)
latency average = 0.278 ms
initial connection time = 166.924 ms
tps = 359368.415058 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.245           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;